JuliusAndreas/Reversi-STM32F3Discovery/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "OthelloLib.h"
#include "LiquidCrystal.h"
#include "stm32f3xx_it.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_FS;

/* USER CODE BEGIN PV */

int state = 0;
int last_push = 0;
int board[8][8];
//2 stands for black, 1 for white
int turn = 2;
int pointer_row = 3;
int pointer_col = 3;
char curr_position[2];


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

extern int time_limit;
extern int remaining_time;
extern unsigned char move_command[4];
typedef unsigned char byte;

byte white_white[] = {
  0x04,
  0x0A,
  0x11,
  0x0E,
  0x04,
  0x0A,
  0x11,
  0x0E
};

byte white_black[] = {
  0x04,
  0x0A,
  0x11,
  0x0E,
  0x04,
  0x0E,
  0x1F,
  0x0E
};

byte black_black[] = {
  0x04,
  0x0E,
  0x1F,
  0x0E,
  0x04,
  0x0E,
  0x1F,
  0x0E
};

byte black_white[] = {
  0x04,
  0x0E,
  0x1F,
  0x0E,
  0x04,
  0x0A,
  0x11,
  0x0E
};

byte black_blank[] = {
  0x04,
  0x0E,
  0x1F,
  0x0E,
  0x00,
  0x00,
  0x00,
  0x00
};

byte blank_black[] = {
  0x00,
  0x00,
  0x00,
  0x00,
  0x04,
  0x0E,
  0x1F,
  0x0E
};

byte white_blank[] = {
  0x04,
  0x0A,
  0x11,
  0x0E,
  0x00,
  0x00,
  0x00,
  0x00
};

byte blank_white[] = {
  0x00,
  0x00,
  0x00,
  0x00,
  0x04,
  0x0A,
  0x11,
  0x0E
};

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){

	if(HAL_GetTick()<last_push+200){
	  	  return;
	}

	last_push = HAL_GetTick();

	setCursor(0, 0);
	if(GPIO_Pin == GPIO_PIN_0){
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);

		//Checking which row it was
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);
		//checking if number was 1
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0)){

			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
		//checking if button was LEFT
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0)){

			if(state==0){

			}else if(state==1){

				if((pointer_col - 1)>=0){
					pointer_col--;
					curr_position[0] = col_num_to_letter(pointer_col);
					setCursor(4, 3);
					print(curr_position);
					char dat[10];
					sprintf(dat, "%d,%d",pointer_col, pointer_row);
					setCursor(0,3);
					print(dat);
				}

			}


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
		//checking if number was 7
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
		//checking if number was *
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0)){

			if(state==0){
				state = 1;
				clear();
				init_map(board);
				//0 stands for empty cells, 1 for white cells and 2 for black cells.
				board[3][3] = 1;
				board[3][4] = 2;
				board[4][3] = 2;
				board[4][4] = 1;
				remaining_time = time_limit;
				HAL_TIM_Base_Start_IT(&htim4);
				HAL_UART_Receive_IT(&huart3, move_command, sizeof(unsigned char)*4);
			}

			return;
		}

	}else if(GPIO_Pin == GPIO_PIN_1){
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);
		//checking if button was UP
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1)){

			if(state==0){

			}else if(state==1){

				if((pointer_row - 1)>=0){
					pointer_row--;
					curr_position[1] = row_num_to_char(pointer_row);
					setCursor(4, 3);
					print(curr_position);
					char dat[10];
					sprintf(dat, "%d,%d",pointer_col, pointer_row);
					setCursor(0,3);
					print(dat);

				}


			}
			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
		//checking if button was select
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1)){

