JuliusAndreas/Reversi-STM32F3Discovery/Core/Src/main.c
			if(state==0){

			}else if(state==1){

				if(isValid(pointer_row, pointer_col, turn)){
					capture(pointer_row, pointer_col, turn);
					print_board();
					show_scores();
					if(switch_turns()){
						state = 3;
						game_over();
						return;
					}
					if(board_is_full()){
						state = 3;
						game_over();
						return;
					}
				}else{
					illegal_move_alert();
				}

			}

			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
		//checking if button was DOWN
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1)){

			if(state==0){

			}else if(state==1){

				if((pointer_row + 1)<8){
					pointer_row++;
					curr_position[1] = row_num_to_char(pointer_row);
					setCursor(4, 3);
					print(curr_position);
					char dat[10];
					sprintf(dat, "%d,%d",pointer_col, pointer_row);
					setCursor(0,3);
					print(dat);
				}

			}

			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
		//checking if number was 11
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1)){


			return;
		}


	}else if(GPIO_Pin == GPIO_PIN_2){
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);
		//checking if number was 3
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
		//checking if button was 6
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
		//checking if number was 9
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
		//checking if number was 12
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2)){


			return;
		}


	}else if(GPIO_Pin == GPIO_PIN_4){
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_RESET);

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);
		//checking if number was 13
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_2, GPIO_PIN_SET);
		//checking if button was RIGHT
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4)){

			if(state==0){

			}else if(state==1){

				if((pointer_col + 1)<8){
					pointer_col++;
					curr_position[0] = col_num_to_letter(pointer_col);
					setCursor(4, 3);
					print(curr_position);
					char dat[10];
					sprintf(dat, "%d,%d",pointer_col, pointer_row);
					setCursor(0,3);
					print(dat);

				}


			}

			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_1, GPIO_PIN_SET);
		//checking if number was 15
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4)){


			return;
		}

		HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
		//checking if number was 16
		if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4)){

			if(state==0){

			}
			return;
		}

	}

}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_USB_PCD_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM4_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */

  HAL_ADC_Start_IT(&hadc1);
  LiquidCrystal(GPIOD, GPIO_PIN_8, GPIO_PIN_9, GPIO_PIN_10, GPIO_PIN_11, GPIO_PIN_12, GPIO_PIN_13, GPIO_PIN_14);

  createChar(0, black_black);
  createChar(1, black_blank);
  createChar(2, blank_black);
  createChar(3, white_black);
  createChar(4, black_white);
  createChar(5, white_blank);
  createChar(6, blank_white);
  createChar(7, white_white);

  begin(20,4);

  setCursor(0, 0);

  print("othello");
  setCursor(0, 1);
  print("Soroosh Faal");
  setCursor(0, 2);
  print("press * to start");

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 0);
  PWM_Change_Tone(3000, 500);

  last_push = HAL_GetTick();
  HAL_TIM_Base_Start_IT(&htim2);

  //empty the board
  for(int i=0;i<8;i++){
	  for(int j=0;j<8;j++){
		  board[i][j] = 0;
	  }
  }

  //initialize current position
  curr_position[0] = 'D';
  curr_position[1] = '4';

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USB|RCC_PERIPHCLK_USART3
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_TIM1
                              |RCC_PERIPHCLK_ADC12;
  PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
  PeriphClkInit.Adc12ClockSelection = RCC_ADC12PLLCLK_DIV1;
  PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_HSI;
  PeriphClkInit.USBClockSelection = RCC_USBCLKSOURCE_PLL_DIV1_5;
  PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

